CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_hpdf.h
/* HPDF_CHxTMFDT */
#define HPDF_CHxTMFDT_TMDATA            BITS(0,15)                      /*!< threshold monitor data */

/* HPDF_CHxPDI */
#define HPDF_CHxPDI_IDATA0              BITS(0,15)                      /*!< data input for channel y or channel y+1 */
#define HPDF_CHxPDI_IDATA1              BITS(16,31)                     /*!< data input for channel y */

/* HPDF_CHxPS */
#define HPDF_CHxPS_PLSK                 BITS(0,5)                       /*!< pulses to skip for input data skipping function */

/* HPDF_FLTyCTL0 */
#define HPDF_FLTyCTL0_FLTEN             BIT(0)                          /*!< HPDF_FLTy enable */
#define HPDF_FLTyCTL0_SICC              BIT(1)                          /*!< start inserted group channel conversion */
#define HPDF_FLTyCTL0_ICSYN             BIT(3)                          /*!< inserted conversion synchronously with the HPDF_FLT0 SICC trigger */
#define HPDF_FLTyCTL0_SCMOD             BIT(4)                          /*!< scan conversion mode of inserted conversions */
#define HPDF_FLTyCTL0_ICDMAEN           BIT(5)                          /*!< DMA channel enabled to read data for the inserted channel group */
#define HPDF_FLTyCTL0_ICTSSEL           BITS(8,12)                      /*!< inserted conversions trigger signal selection */
#define HPDF_FLTyCTL0_ICTEEN            BITS(13,14)                     /*!< inserted conversions trigger edge enable */
#define HPDF_FLTyCTL0_SRCS              BIT(17)                         /*!< start regular channel conversion by software */
#define HPDF_FLTyCTL0_RCCM              BIT(18)                         /*!< regular conversions continuous mode */
#define HPDF_FLTyCTL0_RCSYN             BIT(19)                         /*!< regular conversion synchronously with HPDF_FLT0 */
#define HPDF_FLTyCTL0_RCDMAEN           BIT(21)                         /*!< DMA channel enabled to read data for the regular conversion */
#define HPDF_FLTyCTL0_RCS               BIT(24)                         /*!< regular conversion channel selection*/
#define HPDF_FLTyCTL0_FAST              BIT(29)                         /*!< fast conversion mode enable for regular conversions */
#define HPDF_FLTyCTL0_TMFM              BIT(30)                         /*!< threshold monitor fast mode */

/* HPDF_FLTyCTL1 */
#define HPDF_FLTyCTL1_ICEIE             BIT(0)                          /*!< inserted conversion end interrupt enable */
#define HPDF_FLTyCTL1_RCEIE             BIT(1)                          /*!< regular conversion end interrupt enable */
#define HPDF_FLTyCTL1_ICDOIE            BIT(2)                          /*!< inserted conversion data overflow interrupt enable */
#define HPDF_FLTyCTL1_RCDOIE            BIT(3)                          /*!< regular conversion data overflow interrupt enable */
#define HPDF_FLTyCTL1_TMIE              BIT(4)                          /*!< threshold monitor interrupt enable */
#define HPDF_FLTyCTL1_EMCS              BITS(8,9)                       /*!< extremes monitor channel selection */
#define HPDF_FLTyCTL1_TMCHEN            BITS(16,17)                     /*!< threshold monitor channel enable */
/* only available in HPDF_FLT0CTL1 */
#define HPDF_FLT0CTL1_MMIE              BIT(5)                          /*!< malfunction monitor detector interrupt enable */
#define HPDF_FLT0CTL1_CKLIE             BIT(6)                          /*!< clock loss interrupt enable */

/* HPDF_FLTySTAT */
#define HPDF_FLTySTAT_ICEF              BIT(0)                          /*!< inserted conversion end flag */
#define HPDF_FLTySTAT_RCEF              BIT(1)                          /*!< regular conversion end flag */
#define HPDF_FLTySTAT_ICDOF             BIT(2)                          /*!< inserted conversion data overflow flag */
#define HPDF_FLTySTAT_RCDOF             BIT(3)                          /*!< regular conversion data overflow flag */
#define HPDF_FLTySTAT_TMEOF             BIT(4)                          /*!< threshold monitor event occurred flag */
#define HPDF_FLTySTAT_ICPF              BIT(13)                         /*!< inserted conversion in progress flag */
#define HPDF_FLTySTAT_RCPF              BIT(14)                         /*!< regular conversion in progress flag */
/* only available in HPDF_FLT0STAT */
#define HPDF_FLT0STAT_CKLF              BITS(16,17)                     /*!< clock loss flag */
#define HPDF_FLT0STAT_MMF               BITS(24,25)                     /*!< malfunction monitor detection flag */

/* HPDF_FLTyINTC */
#define HPDF_FLTyINTC_ICDOFC            BIT(2)                          /*!< clear the inserted conversion data overflow flag */
#define HPDF_FLTyINTC_RCDOFC            BIT(3)                          /*!< clear the regular conversion data overflow flag */
/* only available in HPDF_FLT0INTC */
#define HPDF_FLT0INTC_CKLFC             BITS(16,17)                     /*!< clear the clock loss flag */
#define HPDF_FLT0INTC_MMFC              BITS(24,25)                     /*!< clear the malfunction monitor detection flag */

/* HPDF_FLTyIGCS */
#define HPDF_FLTyIGCS_IGCSEL            BITS(0,1)                       /*!< inserted channel group selection */

/* HPDF_FLTySFCFG */
#define HPDF_FLTySFCFG_IOR              BITS(0,7)                       /*!< integrator oversampling rate */
#define HPDF_FLTySFCFG_SFOR             BITS(16,25)                     /*!< Sinc filter oversampling rate (decimation rate) */
#define HPDF_FLTySFCFG_SFO              BITS(29,31)                     /*!< Sinc filter order */

/* HPDF_FLTyIDATA */
#define HPDF_FLTyIDATA_ICCH             BIT(0)                          /*!< inserted channel most recently converted */
#define HPDF_FLTyIDATA_IDTAT            BITS(8,31)                      /*!< inserted group conversion data */

/* HPDF_FLTyRDATA */
#define HPDF_FLTyRDATA_RCCH             BIT(0)                          /*!< regular channel most recently converted */
#define HPDF_FLTyRDATA_RCHPDT           BIT(4)                          /*!< regular channel pending data*/
#define HPDF_FLTyRDATA_RDATA            BITS(8,31)                      /*!< regular channel conversion data */

/* HPDF_FLTyTMHT */
#define HPDF_FLTyTMHT_HTBSD             BITS(0,1)                       /*!< high threshold event break signal distribution */
#define HPDF_FLTyTMHT_HTVAL             BITS(8,31)                      /*!< threshold monitor high threshold value */

/* HPDF_FLTyTMLT */
#define HPDF_FLTyTMLT_LTBSD             BITS(0,1)                       /*!< low threshold event break signal distribution */
#define HPDF_FLTyTMLT_LTVAL             BITS(8,31)                      /*!< threshold monitor low threshold value */

/* HPDF_FLTyTMSTAT */
#define HPDF_FLTyTMSTAT_LTF             BITS(0,1)                       /*!< threshold monitor low threshold flag */
#define HPDF_FLTyTMSTAT_HTF             BITS(8,9)                       /*!< threshold monitor high threshold flag */

